Revit 2024 API
BuiltInFailures.ElectricalFailures.NotEnoughRoomForParallelPipes Property
 Due to changes in elevation, there is not enough room to generate all of the parallel pipes. As a result, some pipe segments have not been generated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotEnoughRoomForParallelPipes { get; }
Visual Basic
Public Shared ReadOnly Property NotEnoughRoomForParallelPipes As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotEnoughRoomForParallelPipes {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace